app/controllers/schools_controller.rb

INSERT INTO "schools" ("school_name", "school_description", "school_address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["school_name", "kachi's school"], ["school_description", "first check"], ["school_address", "my house"], ["created_at", "2015-11-09 18:17:20.612751"], ["updated_at", "2015-11-09 18:17:20.612751"]]
---
    def create
    @school = School.new(school_params)

    if @school.save

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @school = School.find_by(id: params[:id])

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "schools" SET "category" = ?, "picture" = ?, "updated_at" = ? WHERE "schools"."id" = ?  [["category", "Federal"], ["picture", "083b804ce3edc9c2fcfeb61504632dfa13e38237.jpg"], ["updated_at", "2015-11-24 16:33:38.136094"], ["id", 3]]
---
  def update
    @school = School.find_by(id: params[:id])
    if @school.update_attributes(school_params)

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
     @school = School.find_by(id: params[:id])

SELECT COUNT(*) FROM "schools"
SELECT schools.*, (69.09332411348201 * ABS(schools.latitude - 38.9108325) * 0.7071067811865475) + (59.836573914187355 * ABS(schools.longitude - -75.52766989999999) * 0.7071067811865475) AS distance, CASE WHEN (schools.latitude >= 38.9108325 AND schools.longitude >= -75.52766989999999) THEN  45.0 WHEN (schools.latitude <  38.9108325 AND schools.longitude >= -75.52766989999999) THEN 135.0 WHEN (schools.latitude <  38.9108325 AND schools.longitude <  -75.52766989999999) THEN 225.0 WHEN (schools.latitude >= 38.9108325 AND schools.longitude <  -75.52766989999999) THEN 315.0 END AS bearing FROM "schools" WHERE (schools.latitude BETWEEN 38.6213689337783 AND 39.200296066221696 AND schools.longitude BETWEEN -75.89967155222774 AND -75.15566824777224)  ORDER BY distance ASC
---
  def index
  	if params[:query].present?
     #@schools = School.search(params[:query],page: params[:page], per_page: 10, fields: [{school_name: :word_start }, {school_address: :word_start},{location: :word}])
    @schools = School.near(params[:query], 100) #the second option will be the distance in miles. You can  change the dafault to km. Find out later
    else
      #@schools = []
      @schools = School.search(params[:query],page: params[:page], per_page: 10, fields: [{school_name: :word_start }, {school_address: :word_start},{location: :word}])

SELECT COUNT(*) FROM "schools"
---
  def all
    @schools = School.all.paginate(page: params[:page], per_page:10)

SELECT  "schools".* FROM "schools" WHERE "schools"."category" = ? LIMIT 10 OFFSET 0  [["category", "federal"]]
---
  def federal_schools
   @schools = School.where(category: "Federal").paginate(page: params[:page], per_page:10)

SELECT  "schools".* FROM "schools" WHERE "schools"."category" = ? LIMIT 10 OFFSET 0  [["category", "private"]]
SELECT COUNT(*) FROM "schools" WHERE "schools"."category" = ?  [["category", "private"]]
---
  def private_schools
    @schools = School.where(category: "private").paginate(page: params[:page], per_page:10)

SELECT  "schools".* FROM "schools" WHERE "schools"."category" = ? LIMIT 10 OFFSET 0  [["category", "state"]]
---
  def state_schools
    @schools = School.where(category: "state").paginate(page: params[:page], per_page:10)