app/controllers/school_admins_controller.rb

  def index
  	@user = User.find_by(id: params[:id])
  	if current_user.admin?
  		@schools = School.all.paginate(page: params[:page], per_page: 10)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
SELECT COUNT(*) FROM "schools"

  def approve
  	@school = School.find_by(id: params[:id])

  	if @school.approved?
  		@school.update_attributes(approved: false)
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "schools" SET "approved" = ?, "updated_at" = ? WHERE "schools"."id" = ?  [["approved", "f"], ["updated_at", "2015-11-21 15:43:14.831635"], ["id", 1]]