app/controllers/users_controller.rb

	def edit
		@user =  User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

	def update
		@user = User.find_by(id: params[:id])
		if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$hhS/8AnPMJf2kyUQ8e62UeXJbGtyfqI5qkRlwfrvmQmqgt6OZ6/Ri"], ["updated_at", "2015-11-23 17:17:24.057278"], ["id", 1]]